posts/Linux/2016-05-20-Autojump.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-17 Fri 09:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Autojump</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="Autojump; boost your shell experience."
 />
<meta name="keywords" content="Shell, Bash, Change Directory, CD, Speed, Fast, Fasd" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Autojump</h1>
<p>
<b>Autojump</b> is a <code>cd</code> command that learns!  It enables you to easily
navigate directories from the command line:
</p>
<ul class="org-ul">
<li><a href="https://github.com/wting/autojump">Autojump on GitHub</a></li>
</ul>

<p>
It is readily available in most Linux distributions.  The sole thing
that has to be done manually is sourcing a script in your <code>.bashrc</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">source</span> /etc/profile.d/autojump.sh
</pre>
</div>

<p>
Jumping around with <code>j</code> is awesome :-)!
</p>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(Autojump)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><div class='footer'>
Copyright 2015-2017 Dominik Schrempf<br/>
Last updated <span class="timestamp-wrapper"><span class="timestamp">2017-11-17</span></span><br/>
Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.1.2) <br/>
<a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML
</div>
</div>
</body>
</html>
